wr2401/codelearning/stm32learning/stm32 3.0/User/main.c
#include "stm32f10x.h"
#include "timer.h"
#include "key.h"
#include "menu.h"
#include "pwm.h"
#include "motor.h"
#include "encoder.h"
#include "pid.h"
#include "infrared.h"
#include "delay.h"
#include "oled.h"
#include <stdlib.h>
#include <math.h>

PID_Type pid_left, pid_right;
Menu_Param* menu_param;

int main(void)
{
    KEY_Init();
    MENU_Init();
    OLED_Init();
    PWM_Init();
    MOTOR_Init();
    ENCODER_Init();
    INFRARED_Init();
    TIM1_Init();
    
    PID_Init(&pid_left, 1.0, 0.1, 0.01);
    PID_Init(&pid_right, 1.0, 0.1, 0.01);
    
    menu_param = MENU_GetParam();
    
    while(1)
    {
        Key_Type key = KEY_Scan();
        if(key != KEY_NONE)
        {
            MENU_KeyHandler(key);
        }
        
        if(menu_param->on_off)
        {
            // 读取编码器速度
            int16_t speed_left = ENCODER_GetSpeed1();
            int16_t speed_right = ENCODER_GetSpeed2();
            
            // 读取红外循迹误差
            int8_t line_error = INFRARED_GetLineError();
            
            // 基础速度和转向调整
            int16_t base_speed = 40;  // 根据您的PWM周期100调整
            int16_t adjust = line_error * 10;
            
            // 目标速度
            int16_t target_left = base_speed + adjust;
            int16_t target_right = base_speed - adjust;
            
            // PID计算
            float out_left = PID_Calculate(&pid_left, target_left, speed_left);
            float out_right = PID_Calculate(&pid_right, target_right, speed_right);
            
            // 限制输出范围 (您的PWM周期是100)
            if(out_left > 100) out_left = 100;
            if(out_left < -100) out_left = -100;
            if(out_right > 100) out_right = 100;
            if(out_right < -100) out_right = -100;
            
            // 设置电机速度
            MOTOR_SetSpeed((int16_t)out_left, (int16_t)out_right);
        }
        else
        {
            MOTOR_SetSpeed(0, 0);
        }
        
        Delay_ms(10);  // 使用您的Delay_ms
    }
}

void TIM1_UP_IRQHandler(void)
{
    if(TIM_GetITStatus(TIM1, TIM_IT_Update) != RESET)
    {
        // 定时更新PID参数
        pid_left.kp = menu_param->kp;
        pid_left.ki = menu_param->ki;
        pid_left.kd = menu_param->kd;
        
        pid_right.kp = menu_param->kp;
        pid_right.ki = menu_param->ki;
        pid_right.kd = menu_param->kd;
        
        TIM_ClearITPendingBit(TIM1, TIM_IT_Update);
    }
}
